
-------------------------------------
-- 物品附魔信息库 Author: M
-------------------------------------

local MAJOR, MINOR = "LibItemEnchant.7000", 1
local lib = LibStub:NewLibrary(MAJOR, MINOR)

if not lib then
    return
end

--Thanks to RRRRBUA(NGA)

--_era_版本附魔道具没有意义（除了图标多几个）。先统一显示附魔技能吧

local EnchantItemDB = {

  [5423] = 128537,
  [5424] = 128538,
  [5425] = 128539,
  [5426] = 128540,
  [5427] = 128541,
  [5428] = 128542,
  [5429] = 128543,
  [5430] = 128544,
  [5431] = 128545,
  [5432] = 128546,
  [5433] = 128547,
  [5434] = 128548,
  [5435] = 128549,
  [5436] = 128550,
  [5437] = 128551,
  [5438] = 128552,
  [5439] = 128553,
  [5444] = 128558,
  [5445] = 128559,
  [5446] = 128560,
  [5447] = 128561,
  [5440] = 128554,
  [5441] = 140213,
  [5442] = 140214,
  [5443] = 140215,
  [5881] = 140217,
  [5882] = 140218,
  [5883] = 140219,
  [5888] = 141861,
  [5889] = 141908,
  [5890] = 141909,
  [5891] = 141910,
  [5896] = 144305,
  [5899] = 144328,
  [5900] = 144346,
  [5931] = 153247,
  [5929] = 153197,
  [5939] = 153439,
  [5943] = 153443,
  [5955] = 158212,
  --那萊矯捷瞄準鏡 158327
  --5957 炙燃火藥
  --6087 韧性法术丝线
  --6088 谨慎法术丝线
  --6089 轻羽法术丝线
  
  [6108] = 168446,
  [6109] = 168447,
  [6110] = 168448,
  [6111] = 168449,
  [6112] = 168593,
  [6148] = 168596,
  [6149] = 168592,
  [6150] = 168598,
  --戒指 致命 153442
  --戒指 应变 153445
  


}

--Data from: M, RRRRBUA(NGA), KibsItemLevel 

-------------------------------------------------------
--tips--1--2023--03--17--by玉素奴香@哈霍兰CN
--本版Merinspect插件为适配_classic_era_1.14.3版本游戏而修复
--修了几条数值相同位置对应错误的附魔技能&物品ID，发现是同一附魔ID对应多个部位附魔技能。
--数据对应结构是这样的：附魔ID(enchant)--附魔技能ID(spell)--附魔道具ID(item)--学习附魔技能ID(spell)--附魔技能书物品ID(item)
--后三个不一定每种附魔都有，比如很多附魔是训练师直接教的，没有最后一步；而_classic_era_版本没有附魔羊皮纸，基本不会有附魔道具；头腿肩NPC卖的附魔没后两步。
--个人猜测这个类似于暗黑2属性词条，至少在_classic_era_版本，同一数值属性是个唯一性光环（enchant，类似于aura）,被多个部位引用。
--怪不得这插件十几年过了这么多大佬的手还是这个鸟样。真是个天坑。

--tips--2--
--via 暧昧的呓语@https://bbs.nga.cn/read.php?tid=33886174 大佬的帖子里学习到了处理分支的方法。
--利用了大佬v1.2版本的\MerInspect\libs\LibItemEnchant.lua数据库文件。
--重新整理排序了_era_版本的附魔相关内容
--所以本插件仅适用于_era_版本游戏

--tips--3--
--游戏主lua套件使用的是 Qcat@http://wowcat.net/bbs/new/topic/1631-1 猫站长大佬的版本，似乎19年在那里下载这个后我这里一直就没有被更新覆盖过，原站网盘链接都无了哈哈……
--因为我找到的所有后续版本C面板角色属性统计中，都有很多条目不显示了，比如法术命中、物理命中等。
--而且这些版本似乎脱依赖库都没弄干净，也一样需要诸如有爱控制台、大脚控制台所带的依赖库。否则1.14.3版本游戏单独测试插件，可以载入，但不能显示装备统计和属性统计面板。
--现在其他面板插件、WA字符串，法术命中、物理命中、治疗强度等面板统计都不能反馈出数值，GetSpellHitModifier()\GetHitModifier()\GetSpellBonusHealing()这几个API都失效了。
--我手里这版本插件能统计出这几项数值，本人研究插件刚起步水平很差，没有能力寻么它是咋实现的，和其他版本插件区别在哪。
--所以插件能用能正常显示就不再继续深入脱库了。而且设置生效似乎也不太灵光，这个也没能力深入研究了。

--tips--4--
--本版Merinspect需要配合配合加载以下任意一款网易插件，才能正常工作，否则单独Merinspect插件在1.14.3版本游戏不能显示统计面板：
--!!!163UI!!!网易有爱控制台、
--alaChat_Classic聊天插件（旧版）、
--alaTrade拍卖行插件、
--alaMisc实用小功能、
--InstanceLockeddownTimer 有爱爆本计时器。

--有爱离线包地址@https://wowui.w.163.com/163ui/ 

--大脚控制台我试过了不能行。
--似乎是这几款网易插件里的\ala\fix.lua脚本起了作用。不过单独在Merinspect.toc里加载这个lua并不能完全正常工作，这样C面板装备统计可以显示，但属性统计不行。还是要正常使用任意一款。

--不按此条说明使用，插件不生效概不负责！！（因为没有盘代码函数的能力）！！除非您有能力自己处理代码。

--tip--5--
--再次感谢 暧昧的呓语@NGA大佬修复的后续大版本适配版。我这里其实就是吃了他现成的思路，把这个数据库缝合到另外一版插件里。各位如果需要下载woltk版Merinspect可以到上面他的帖子中下载。
--欢迎各位观众姥爷二次开发，望有兴趣的大佬可以继续整理把主lua处理干净~
--万分感谢前人的研究整理。


local EnchantSpellDB = {

  [15] = 2831, -- 轻型护甲片
  [16] = 2832, -- 中型护甲片
  [17] = 2833, -- 重型护甲片
  [18] = 10344, -- 厚重护甲片
  [24] = 7443, -- 卷轴：附魔胸甲 - 初级法力
  [30] = 3974, -- 粗制瞄准镜
  [32] = 3975, -- 普通瞄准镜
  [33] = 3976, -- 精确瞄准镜
  [34] = 7218, -- 铁质平衡锤
  [36] = 6296, -- 炽热魔符
  [37] = 7220, -- 钢质武器链
 --[41] = 7420, -- 附魔胸甲 - 初级生命 --文本末尾已赋分支
  [43] = 7216, -- 铁质盾刺
  [44] = 7426, -- 卷轴：附魔胸甲 - 初级吸收
  [63] = 13538, -- 卷轴：附魔胸甲 - 次级吸收
  [65] = 7454, -- 卷轴：附魔披风 - 初级抗性
  [66] = 13378, -- 卷轴：附魔盾牌 - 初级耐力
  [242] = 7748, -- 卷轴：附魔胸甲 - 次级生命
  [243] = 7766, -- 卷轴：附魔护腕 - 初级精神
  [246] = 7776, -- 卷轴：附魔胸甲 - 次级法力
  [247] = 13419, -- 卷轴：附魔披风 - 初级敏捷
  [248] = 7782, -- 卷轴：附魔护腕 - 初级力量
  [249] = 7786, -- 卷轴：附魔武器 - 初级屠兽
  [250] = 7788, -- 卷轴：附魔武器 - 初级攻击
  [254] = 7857, -- 卷轴：附魔胸甲 - 生命
  [256] = 7861, -- 卷轴：附魔披风 - 次级火焰抗性
  [368] = 34004, -- 附魔披风 - 强效敏捷
  [369] = 34001, -- 附魔护腕 - 特效智力
  [463] = 9781, -- 秘银盾刺
  [464] = 9783, -- 秘银马刺
  [663] = 12459, -- 致命瞄准镜
  [664] = 12460, -- 狙击瞄准镜
  [684] = 33995, -- 附魔手套 - 特效力量
  [724] = 13644, -- 卷轴：附魔靴子 - 次级耐力
  [744] = 13421, -- 卷轴：附魔披风 - 次级防护
  [783] = 7771,  -- 卷轴：附魔披风 - 初级防护
  [803] = 13898, -- 卷轴：附魔武器 - 烈焰
  [804] = 13522, -- 卷轴：附魔披风 - 次级暗影抵抗
  [805] = 13943, -- 卷轴：附魔武器 - 强效攻击
  [823] = 13536, -- 卷轴：附魔护腕 - 次级力量
  [843] = 13607, -- 卷轴：附魔胸甲 - 法力
  [844] = 13612, -- 卷轴：附魔手套 - 采矿
  [845] = 13617, -- 卷轴：附魔手套 - 草药学
  [846] = 24302, -- 高强度恒金渔线
  [847] = 13626, -- 卷轴：附魔胸甲 - 初级属性
 --[848] = 13635, -- 附魔披风 - 防御 --已附分支
 --[849] = 13882, --已附分支--修复错误附魔ID13637，这个是鞋+3敏，此处应为披风+3敏，数值一样的附魔同ID，披风+3敏比鞋常用，先暂时记为披风
  [851] = 20024, -- 卷轴：附魔靴子 - 精神
  [852] = 13836, -- 卷轴：附魔靴子 - 耐力
  [853] = 13653, -- 卷轴：附魔武器 - 次级屠兽
  [854] = 13655, -- 卷轴：附魔武器 - 次级元素杀手
  [857] = 13663, -- 卷轴：附魔胸甲 - 强效法力
  [863] = 13689, -- 卷轴：附魔盾牌 - 次级格挡
  [865] = 13698, -- 卷轴：附魔手套 - 剥皮
  [866] = 13700, -- 卷轴：附魔胸甲 - 次级状态
  [884] = 13746, -- 卷轴：附魔披风 - 强效防御
--[904] = 13935, -- 附魔靴子 - 敏捷 --已赋分支
  [905] = 13822, -- 卷轴：附魔护腕 - 智力
  [906] = 13841, -- 卷轴：附魔手套 - 高级采矿
--[907] = 13846, -- 附魔护腕 - 强效精神 --已赋分支
  [908] = 13858, -- 卷轴：附魔胸甲 - 超强生命
  [909] = 13868, -- 卷轴：附魔手套 - 高级草药学
  [910] = 25083, -- 附魔披风 - 潜行
  [911] = 13890, -- 卷轴：附魔靴子 - 初级速度
  [912] = 13915, -- 卷轴：附魔武器 - 屠魔
  [913] = 13917, -- 卷轴：附魔胸甲 - 超强法力
  [923] = 13931, -- 卷轴：附魔护腕 - 偏斜
  [924] = 7428, -- 卷轴：附魔护腕 - 初级偏斜
  [925] = 13646, -- 卷轴：附魔护腕 - 次级偏斜
  [926] = 13933, -- 附魔盾牌 - 冰霜抗性
  [928] = 13941, -- 卷轴：附魔胸甲 - 状态
--[929] = 20017, --已附分支--修复错误附魔ID22020，这个是鞋子+7耐力，此处是副手盾牌+7耐，数值一样的附魔同ID，盾牌+7耐比鞋常用，先暂时记为盾牌
  [930] = 13947, -- 卷轴：附魔手套 - 骑乘
  [931] = 13948, -- 卷轴：附魔手套 - 初级加速
--[943] = 13529, --附魔双手武器 - 次级冲击 --已赋分支
--[963] = 13937, -- 附魔双手武器 - 强效冲击 --已赋分支
---------_era_后续版本内容，无用--------
  [1071] = 34009, -- 附魔盾牌 - 特效耐力
  [1075] = 44528, -- 卷轴：附魔靴子 - 强效耐力
  [1099] = 60663, -- 卷轴：附魔披风 - 特效敏捷
  [1103] = 44633, -- 卷轴：附魔武器 - 优异敏捷
  [1119] = 44555, -- 卷轴：附魔护腕 - 优异智力
  [1128] = 60653, -- 卷轴：附魔盾牌 - 强效智力
  [1257] = 34005, -- 附魔披风 - 强效奥术抗性
  [1262] = 44596, -- 卷轴：附魔披风 - 超强奥术抗性
  [1354] = 44556, -- 卷轴：附魔披风 - 超强火焰抗性
  [1400] = 44494, -- 卷轴：附魔披风 - 超强自然抗性
  [1441] = 34006, -- 附魔披风 - 强效暗影抗性
  [1144] = 33990, -- 附魔胸甲 - 特效精神
  [1446] = 44590, -- 卷轴：附魔披风 - 超强暗影抗性 
--[1147] = 44508, -- 附魔靴子 - 强效精神
---------------------厄运秘药系列
  [1483] = 15340, -- 次级冥思秘药
  [1503] = 15389, -- 次级体质秘药
  [1504] = 15391, -- 次级坚韧秘药
  [1505] = 15394, -- 次级适应秘药
  [1506] = 15397, -- 次级贪婪秘药
  [1507] = 15400, -- 次级贪婪秘药
  [1508] = 15402, -- 次级贪婪秘药
  [1509] = 15404, -- 次级贪婪秘药
  [1510] = 15406, -- 次级贪婪秘药
----------------更高级的奥术融合，看起来是厄运秘药的升级版，似乎字段是废弃了？
  [1523] = 15427,
  [1524] = 15429,
  [1525] = 15439,
  [1526] = 15441,
  [1527] = 15444,
  [1528] = 15446,
  [1529] = 15449,
  [1530] = 15458,
  [1532] = 15463,
  [1543] = 15490,
-------tbc内容--------------------------
  [1594] = 33996, -- 附魔手套 - 突袭
  [1597] = 60763, -- 卷轴：附魔靴子 - 强效突袭
  [1600] = 60616, -- 卷轴：附魔护腕 - 打击
  [1603] = 60668, -- 卷轴：附魔手套 - 碾压
  [1606] = 60621, -- 卷轴：附魔武器 - 强效潜能
---------------------------------------
  [1704] = 16623, -- 瑟银盾刺
  [1843] = 19057, -- 毛皮护甲片
  [1883] = 20008, -- 卷轴：附魔护腕 - 强效智力
  [1884] = 20009, -- 卷轴：附魔护腕 - 超强精神
  [1885] = 20010, -- 卷轴：附魔护腕 - 超强力量
  [1886] = 20011, -- 卷轴：附魔护腕 - 超强耐力
--[1887] = 20023, --已赋分支--修复错误附魔ID20012，这是手套+7敏，此处应为鞋+7敏，数值一样的附魔同ID，鞋7敏比手常用，先暂时记为鞋
  [1889] = 20015, -- 卷轴：附魔披风 - 超强防御
  [1890] = 20016, -- 卷轴：附魔盾牌 - 活力
  [1892] = 20026, -- 卷轴：附魔胸甲 - 特效生命
  [1893] = 20028, -- 卷轴：附魔胸甲 - 特效法力
  [1894] = 20029, -- 卷轴：附魔武器 - 冰寒
  [1896] = 20030, -- 卷轴：附魔双手武器 - 超强冲击
--[1897] = 20031, --已赋分支--修复错误附魔ID13695，这是双手武器+5伤害，此处应为单手武器，数值一样的附魔同ID，单手5伤害比双手常用，先暂时记为单手
  [1898] = 20032, -- 附魔武器 - 生命偷取
  [1899] = 20033, -- 卷轴：附魔武器 - 邪恶武器
  [1900] = 20034, -- 卷轴：附魔武器 - 十字军
  [1903] = 20035, -- 卷轴：附魔双手武器 - 特效精神
  [1904] = 20036, -- 卷轴：附魔双手武器 - 特效智力
  [1952] = 44489, -- 卷轴：附魔盾牌 - 防御
  [1953] = 47766, -- 卷轴：附魔胸甲 - 强效防御
  [2322] = 33999, -- 附魔手套 - 特效治疗
  [2326] = 44635, -- 卷轴：附魔护腕 - 强效法术能量
  [2332] = 60767, -- 卷轴：附魔护腕 - 超强法术能量
  [2381] = 44509, -- 卷轴：附魔胸甲 - 强效法力回复
  [2443] = 21931, -- 卷轴：附魔武器 - 寒冬之力
  [2463] = 13657, -- 卷轴：附魔披风 - 火焰抗性
  [2483] = 22593, -- 火焰黎明衬肩
  [2484] = 22594, -- 冰霜黎明衬肩
  [2485] = 22598, -- 奥术黎明衬肩
  [2486] = 22597, -- 自然黎明衬肩
  [2487] = 22596, -- 暗影黎明衬肩
  [2488] = 22599, -- 多彩黎明衬肩
  [2503] = 22725, -- 熔火护甲片
  [2504] = 22749, -- 卷轴：附魔武器 - 法术能量
  [2505] = 22750, -- 卷轴：附魔武器 - 治疗能量
  [2523] = 22779, -- 比兹尼克247x128精确瞄准镜
  [2543] = 22840, -- 急速秘药
  [2544] = 22844, -- 专注秘药
  [2545] = 22846, -- 防护秘药
  [2563] = 23799, -- 卷轴：附魔武器 - 力量
--[2564] = 25080, --已赋分支 --修复错误附魔ID，武器+15敏23800和手套+15敏附魔ID25080都是2564，个人猜测附魔ID是个属性字段，类似于暗黑2.手15敏比武器常用，先暂时记为手
  [2565] = 23801, -- 卷轴：附魔护腕 - 法力回复
  [2566] = 23802, --修复，添加手腕治疗能力+24奶
  [2567] = 23803, -- 附魔武器 - 强效精神
  [2568] = 23804, -- 卷轴：附魔武器 - 强效智力
  [2583] = 24149, -- 力量的证明
  [2584] = 24160, -- 调和的徽记
  [2585] = 24161, -- 修复，添加祖格盗贼头腿
  [2587] = 24163, -- 巫毒的警觉
  [2588] = 24164, -- 魔法的视域
  [2589] = 24165, -- 不祥的妖术
  [2590] = 24167, -- 预言的光环
  [2591] = 24168, -- 灵魂的安抚
  [2603] = 13620, -- 卷轴：附魔手套 - 钓鱼
  [2604] = 24420, -- 赞达拉宁静徽记
  [2605] = 24421, -- 赞达拉魔精徽记
  [2606] = 24422, -- 赞达拉力量徽记
  [2613] = 25072, -- 附魔手套 - 威胁
  [2614] = 25073, -- 卷轴：附魔手套 - 暗影能量
  [2615] = 25074, -- 卷轴：附魔手套 - 冰霜能量
  [2616] = 25078, -- 卷轴：附魔手套 - 火焰能量
  [2617] = 25079, -- 卷轴：附魔手套 - 治疗能量
  [2621] = 25084, -- 附魔披风 - 狡诈
  [2622] = 25086, -- 卷轴：附魔披风 - 躲闪
  [2646] = 27837, -- 卷轴：附魔双手武器 - 敏捷
 --_era_后续版本内容--------被注释掉的都是底部已附分支的条目
  [2647] = 27899, -- 附魔护腕 - 强壮
--[2648] = 27906, -- 附魔双手武器 - 敏捷
--[2649] = 27914, -- 附魔护腕 - 坚韧
  [2650] = 27917, -- 附魔护腕 - 法术能量
  [2653] = 27944, -- 卷轴：附魔盾牌 - 坚韧盾牌
  [2654] = 27945, -- 附魔盾牌 - 智力
  [2655] = 27946, -- 附魔盾牌 - 盾牌格档
  [2656] = 27948, -- 附魔长靴 - 活力
  [2657] = 27951, -- 附魔长靴 - 灵巧
  [2658] = 27954, -- 附魔长靴 - 稳固
  [2659] = 27957, -- 附魔胸甲 - 优异生命
--[2661] = 27960,
  [2662] = 27961, -- 附魔披风 - 特效护甲
  [2664] = 27962, -- 附魔披风 - 特效抗性
  [2666] = 27968, -- 附魔武器 - 特效智力
  [2667] = 27971, -- 附魔双手武器 - 野蛮
  [2668] = 27972, -- 附魔武器 - 潜能
  [2669] = 27975, -- 附魔武器 - 特效法术能量
  [2670] = 27977, -- 附魔双手武器 - 特效敏捷
  [2671] = 27981, -- 附魔武器 - 阳炎
  [2672] = 27982, -- 附魔武器 - 魂霜
  [2673] = 27984, -- 附魔武器 - 猫鼬
  [2674] = 28003, -- 附魔武器 - 魔法激荡
  [2675] = 28004, -- 附魔武器 - 作战专家
  [2679] = 27913, -- 附魔护腕 - 原始法力
--这几个有用---    
  [2681] = 28161, -- 野性戒卫
  [2682] = 28163, -- 寒冰戒卫
  [2683] = 28165, -- 暗影戒卫
  [2714] = 29454, -- 魔钢盾刺
  [2715] = 29475, -- 天灾的活力
  [2716] = 29480, -- 天灾的坚韧
  [2717] = 29483, -- 天灾的威严
  [2721] = 29467, -- 天灾的力量
---以下为TBC内容
  [2722] = 30250,
  [2723] = 30252,
--[2724] = 30260,
  [2745] = 31369,
  [2746] = 31370,
  [2747] = 31371,
  [2748] = 31372,
  [2792] = 32397,
  [2793] = 32398,
  [2794] = 32399,
  [2841] = 44968,
  [2933] = 33992,
  [2934] = 33993,
  [2935] = 33994,
  [2937] = 33997,
  [2938] = 34003,
  [2939] = 34007,
  [2940] = 34008,
  [2977] = 35355,
  [2978] = 35402,
  [2979] = 35403,
  [2980] = 35404,
  [2981] = 35405,
  [2982] = 35406,
  [2983] = 35407,
  [2984] = 35415,
  [2985] = 35416,
  [2986] = 35417,
  [2987] = 35418,
  [2988] = 35419,
  [2989] = 35420,
  [2990] = 35432,
  [2991] = 35433,
  [2992] = 35434,
  [2993] = 35435,
  [2994] = 35436,
  [2995] = 35437,
  [2996] = 35438,
  [2997] = 35439,
  [2998] = 35441,
  [2999] = 35443,
  [3001] = 35445,
  [3002] = 35447,
  [3003] = 35452,
  [3004] = 35453,
  [3005] = 35454,
  [3006] = 35455,
  [3007] = 35456,
  [3008] = 35457,
  [3009] = 35458,
  [3010] = 35488,
  [3011] = 35489,
  [3012] = 35490,
  [3013] = 35495,
  [3095] = 37889,
  [3096] = 37891,
  [3150] = 33991,
--[3222] = 42620,
  [3223] = 42687,
  [3225] = 42974,
  [3228] = 44119,
  [3229] = 44383,
--[3231] = 44484,
  [3232] = 47901,
  [3233] = 27958,
  [3234] = 44488,
  [3236] = 44492,
  [3238] = 44506,
  [3239] = 44524,
  [3241] = 44576,
  [3243] = 44582,
  [3244] = 44584,
  [3245] = 44588,
  [3246] = 44592,
  [3247] = 44595,
  [3249] = 44612,
  [3251] = 44621,
  [3252] = 44623,
  [3253] = 44625,
  [3256] = 44631,
  [3260] = 44769,
  [3269] = 45697,
  [3273] = 46578,
  [3289] = 47103,
  [3294] = 47672,
  [3296] = 47899,
  [3297] = 47900,
  [3315] = 48401,
  [3325] = 50901,
  [3326] = 50902,
  [3329] = 50906,
  [3330] = 50909,
  [3332] = 50913,
  [3366] = 53331,
  [3367] = 53342,
  [3368] = 53344,
  [3370] = 53343,
  [3595] = 54447,
  [3599] = 54736,
  [3601] = 54793,
  [3605] = 55002,
  [3607] = 55076,
  [3608] = 55135,
  [3718] = 55630,
  [3719] = 55631,
  [3720] = 55632,
  [3721] = 55634,
  [3731] = 55836,
  [3748] = 56353,
  [3754] = 24162,
--[3755] = 24161, --24161重复了，这里先注释掉
  [3775] = 58126,
  [3776] = 58128,
  [3777] = 58129,
  [3788] = 59619,
  [3789] = 59621,
  [3790] = 59625,
  [3793] = 59771,
  [3794] = 59773,
  [3795] = 59777,
  [3796] = 59778,
  [3797] = 59784,
  [3806] = 59927,
  [3807] = 59928,
  [3808] = 59934,
  [3809] = 59936,
  [3810] = 59937,
  [3811] = 59941,
  [3812] = 59944,
  [3813] = 59945,
  [3814] = 59946,
  [3815] = 59947,
  [3816] = 59948,
  [3817] = 59954,
  [3818] = 59955,
  [3819] = 59960,
  [3820] = 59970,
  [3822] = 60581,
  [3823] = 60582,
  [3824] = 60606,
  [3825] = 60609,
  [3826] = 60623,
  [3827] = 60691,
  [3828] = 44630,
  [3829] = 44513,
  [3830] = 44629,
  [3831] = 47898,
  [3832] = 60692,
  [3833] = 60707,
  [3834] = 60714,
  [3835] = 61117,
  [3836] = 61118,
  [3837] = 61119,
  [3838] = 61120,
  [3842] = 61271,
  [3843] = 61468,
  [3844] = 44510,
  [3845] = 44575,
  [3846] = 34010,
  [3847] = 62158,
  [3849] = 62201,
  [3850] = 62256,
  [3851] = 62257,
  [3852] = 62384,
  [3853] = 62447,
  [3854] = 62948,
  [3855] = 62959,
  [3858] = 63746,
  [3869] = 64441,
  [3870] = 64579,
  [3872] = 56039,
  [3873] = 56034,
  [3875] = 59929,
  [3876] = 59932,
  [4061] = 74132,
  [4062] = 74189,
  [4063] = 74191,
  [4064] = 74192,
  [4065] = 74193,
  [4066] = 74195,
  [4067] = 74197,
  [4068] = 74198,
  [4069] = 74199,
  [4070] = 74200,
  [4071] = 74201,
  [4072] = 74202,
  [4073] = 74207,
  [4074] = 74211,
  [4075] = 74212,
  [4076] = 74213,
  [4077] = 74214,
  [4082] = 74220,
  [4083] = 74223,
  [4084] = 74225,
  [4085] = 74226,
  [4086] = 74229,
  [4087] = 74230,
  [4088] = 74231,
  [4089] = 74232,
  [4090] = 74234,
  [4091] = 74235,
  [4092] = 74236,
  [4093] = 74237,
  [4094] = 74238,
  [4095] = 74239,
  [4096] = 74240,
  [4097] = 74242,
  [4098] = 74244,
  [4099] = 74246,
  [4100] = 74247,
  [4101] = 74248,
  [4102] = 74250,
  [4103] = 74251,
  [4104] = 74253,
  [4105] = 74252,
  [4106] = 74254,
  [4107] = 74255,
  [4108] = 74256,
  [4109] = 75149,
  [4110] = 75150,
  [4111] = 75151,
  [4112] = 75152,
  [4113] = 75154,
  [4114] = 75155,
  [4120] = 78165,
  [4121] = 78166,
  [4122] = 78169,
  [4124] = 78170,
  [4126] = 78171,
  [4127] = 78172,
  [4175] = 81932,
  [4176] = 81933,
  [4177] = 81934,
  [4187] = 84424,
  [4188] = 84427,
  [4193] = 86375,
  [4194] = 86401,
  [4195] = 86402,
  [4196] = 86403,
  [4197] = 86847,
  [4198] = 86854,
  [4199] = 86898,
  [4200] = 86899,
  [4201] = 86900,
  [4202] = 86901,
  [4203] = 86906,
  [4204] = 86907,
  [4205] = 86909,
  [4206] = 86931,
  [4207] = 86932,
  [4208] = 86933,
  [4209] = 86934,
  [4214] = 84425,
  [4215] = 92433,
  [4216] = 92437,
  [4217] = 93448,
  [4222] = 67839,
  [4223] = 55016,
  [4227] = 95471,
  [4245] = 96245,
  [4246] = 96246,
  [4247] = 96247,
  [4248] = 96249,
  [4249] = 96250,
  [4250] = 96251,
  [4256] = 96261,
  [4257] = 96262,
  [4258] = 96264,
  [4259] = 96286,
  [4267] = 99623,
  [4270] = 101598,
  [4411] = 104338,
  [4412] = 104385,
  [4414] = 104389,
  [4415] = 104390,
  [4416] = 104391,
  [4417] = 104392,
  [4418] = 104393,
  [4419] = 104395,
  [4420] = 104397,
  [4421] = 104398,
  [4422] = 104401,
  [4423] = 104403,
  [4424] = 104404,
  [4426] = 104407,
  [4427] = 104408,
  [4428] = 104409,
  [4429] = 104414,
  [4430] = 104416,
  [4431] = 104417,
  [4432] = 104419,
  [4433] = 104420,
  [4434] = 104445,
  [4441] = 104425,
  [4442] = 104427,
  [4443] = 104430,
  [4444] = 104434,
  [4445] = 104440,
  [4446] = 104442,
  [4687] = 108115,
  [4699] = 109086,
  [4700] = 109093,
  [4717] = 110764,
  [4719] = 113011,
--[4720] = 7418, --附魔护腕 - 初级生命
--[4721] = 7457,  
  [4722] = 13378,
--[4723] = 7745,
  [4724] = 13419,
--[4725] = 7779,
--[4726] = 13687,
--[4727] = 7859,
--[4728] = 13485,
--[4729] = 13622,
--[4730] = 13501,
--[4731] = 13631,
  [4732] = 71692,
--[4733] = 13464,
--[4734] = 13882,
--[4735] = 13642,
--[4736] = 13659,
--[4737] = 13648,
--[4738] = 13817,
--[4739] = 13887,
--[4740] = 13815,
--[4741] = 13905,
--[4742] = 20013,
--[4743] = 13945,
--[4744] = 20017,
--[4745] = 13693,
--[4746] = 27967,
--[4747] = 44500,
--[4748] = 44589,
  [4750] = 82200,
  [4803] = 121192,
  [4804] = 121193,
  [4805] = 121194,
  [4806] = 121195,
  [4808] = 121988,
  [4822] = 122387,
  [4823] = 122388,
  [4824] = 122386,
  [4825] = 122392,
  [4826] = 122393,
  [4869] = 124091,
  [4870] = 124116,
  [4871] = 124118,
  [4872] = 124119,
  [4880] = 124559,
  [4881] = 124561,
  [4882] = 124563,
  [4883] = 124564,
  [4884] = 124565,
  [4885] = 124566,
  [4886] = 124567,
  [4887] = 124568,
  [4888] = 124569,
  [4895] = 125496,
  [4896] = 125497,
  [4897] = 126392,
  [4907] = 127015,
  [4908] = 127014,
  [4909] = 127013,
  [4910] = 127012,
  [4912] = 113048,
  [4913] = 113047,
  [4914] = 113046,
  [4915] = 113045,
  [4916] = 113044,
  [4918] = 128286,
  [4992] = 130749,
  [4993] = 130758,
  [5000] = 109099,
  [5001] = 131464,
  [5003] = 131862,
  [5004] = 131863,
  [5035] = 139631,
  [5055] = 141167,
  [5056] = 141168,
  [5057] = 141170,
  [5058] = 141173,
  [5059] = 141174,
  [5060] = 141175,
  [5061] = 141176,
  [5062] = 141177,
  [5063] = 141330,
  [5076] = 141445,
  [5080] = 141862,
  [5081] = 141868,
  [5091] = 141971,
  [5092] = 141973,
  [5093] = 141974,
  [5094] = 141975,
  [5095] = 141976,
  [5096] = 141977,
  [5097] = 141978,
  [5098] = 141981,
  [5099] = 141982,
  [5100] = 141983,
  [5101] = 141984,
  [5110] = 142173,
  [5111] = 142175,
  [5112] = 142177,
  [5113] = 142178,
  [5124] = 142469,
  [5125] = 142468,
  [5183] = 27911,
  [5184] = 27917,
  [5237] = 33990,
  [5250] = 33995,
  [5255] = 33996,
  [5257] = 34002,
  [5258] = 34004,
--[5259] = 44529,
--[5260] = 46594,
  [5274] = 155692,
  [5275] = 156050,
  [5276] = 156061,
  [5281] = 158877,
  [5284] = 158907,
  [5285] = 158892,
  [5292] = 158893,
  [5293] = 158894,
  [5294] = 158895,
  [5295] = 158896,
  [5297] = 158908,
  [5298] = 158878,
  [5299] = 158909,
  [5300] = 158879,
  [5301] = 158910,
  [5302] = 158880,
  [5303] = 158911,
  [5304] = 158881,
  [5310] = 158884,
  [5311] = 158885,
  [5312] = 158886,
  [5313] = 158887,
  [5314] = 158889,
  [5317] = 158899,
  [5318] = 158900,
  [5319] = 158901,
  [5320] = 158902,
  [5321] = 158903,
  [5324] = 158914,
  [5325] = 158915,
  [5326] = 158916,
  [5327] = 158917,
  [5328] = 158918,
  [5330] = 159235,
  [5331] = 159236,
  [5334] = 159672,
  [5335] = 159673,
  [5336] = 159674,
  [5337] = 159671,
  [5352] = 170627,
  [5353] = 170628,
  [5354] = 170629,
  [5355] = 170630,
  [5356] = 170631,
  [5357] = 170886,
  [5383] = 173287,
  [5384] = 173323,
  [5423] = 190866,
  [5424] = 190867,
  [5425] = 190868,
  [5426] = 190869,
  [5427] = 190870,
  [5428] = 190871,
  [5429] = 190872,
  [5430] = 190873,
  [5431] = 190874,
  [5432] = 190875,
  [5433] = 190876,
  [5434] = 190877,
  [5435] = 190878,
  [5436] = 190879,
  [5437] = 190892,
  [5438] = 190893,
  [5439] = 190894,
  [5889] = 228402,
  [5890] = 228405,
  [5891] = 228408,
  [5444] = 190988,
  [5445] = 190989,
  [5446] = 190990,
  [5447] = 190991,
  [5440] = 190954,
  [5441] = 190955,
  [5442] = 190956,
  [5443] = 190957,
  [5881] = 222851,
  [5882] = 222852,
  [5883] = 222853,
  [5888] = 228139,
--[5898] = , +9致命
  [5899] = 235731,
  [5900] = 235795,
  [5932] = 255035,
  [5933] = 255040,
  [5934] = 255065,
  [5935] = 255066,
  [5936] = 255068,
  [5937] = 255070,
  [5938] = 255071,
  [5939] = 255072,
  [5940] = 255073,
  [5941] = 255074,
  [5942] = 255086,
  [5943] = 255087,
  [5944] = 255088,
  [5945] = 255089,
  [5946] = 255103,
  [5948] = 255110,
  [5949] = 255129,
  [5950] = 255141,
  [5962] = 268852,
  [5963] = 268894,
  [5964] = 268901,
  [5965] = 268907,
  [5966] = 268913,
  [5970] = 271366,
  [5971] = 271433,

}

--[[

"INVTYPE_AMMO"	Ammo	0   弹药
"INVTYPE_HEAD"	Head	1   头盔
"INVTYPE_NECK"	Neck	2   项链
"INVTYPE_SHOULDER"	Shoulder	3   肩膀
"INVTYPE_BODY"	Shirt	4   衬衣
"INVTYPE_CHEST"	Chest	5   胸部
"INVTYPE_ROBE"	Chest	5   ？长袍
"INVTYPE_WAIST"	Waist	6   腰部
"INVTYPE_LEGS"	Legs	7   腿 
"INVTYPE_FEET"	Feet	8   鞋
"INVTYPE_WRIST"	Wrist	9   手腕
"INVTYPE_HAND"	Hands	10  手套
"INVTYPE_FINGER"	Fingers	11,12   戒指
"INVTYPE_TRINKET"	Trinkets	13,14   饰品
"INVTYPE_CLOAK"	Cloaks	15  披风
"INVTYPE_WEAPON"	One-Hand	16,17   主副单手
"INVTYPE_SHIELD"	Shield	17  盾牌
"INVTYPE_2HWEAPON"	Two-Handed	16  双手武器

]]

local EnchantSpellDBEx = {

  [41] = {
      INVTYPE_WRIST = 7418, -- 卷轴：附魔护腕 - 初级生命
      INVTYPE_CHEST = 7420, -- 卷轴：附魔胸甲 - 初级生命
      INVTYPE_ROBE = 7420 -- 卷轴：附魔胸甲 - 初级生命 --根据上面装备栏位命名，胸部似乎分为上衣下裳的CHEST和连襟长袍ROBE。实践必须要引两个分支，不然有一种类型附魔会显示问号
  },
  [66] = {
      INVTYPE_WRIST = 7457, -- 卷轴：附魔护腕 - 初级耐力
      INVTYPE_FEET = 7863 -- 卷轴：附魔靴子 - 初级耐力
  },
  [247] = {
      INVTYPE_WRIST = 7779, -- 卷轴：附魔护腕 - 初级敏捷
      INVTYPE_FEET = 7867 -- 卷轴：附魔靴子 - 初级敏捷
  },
  [255] = {
      INVTYPE_WRIST = 7859, -- 卷轴：附魔护腕 - 次级精神
      INVTYPE_2HWEAPON = 13380, -- 卷轴：附魔双手武器 - 次级精神
      INVTYPE_SHIELD = 13485, -- 卷轴：附魔盾牌 - 次级精神
      INVTYPE_FEET = 13687 -- 卷轴：附魔靴子 - 次级精神
  },
  [241] = {
      INVTYPE_2HWEAPON = 7745, -- 卷轴：附魔双手武器 - 初级冲击
      INVTYPE_WEAPON = 13503 -- 卷轴：附魔武器 - 次级攻击
  },
  [723] = {
      INVTYPE_2HWEAPON = 7793, -- 卷轴：附魔双手武器 - 次级智力
      INVTYPE_WRIST = 13622 -- 卷轴：附魔护腕 - 次级智力
  },
  [724] = {
      INVTYPE_WRIST = 13501, -- 卷轴：附魔护腕 - 次级耐力
      INVTYPE_SHIELD = 13631 -- 卷轴：附魔盾牌 - 次级耐力
  },
  [848] = {
      INVTYPE_SHIELD = 13464, -- 卷轴：附魔盾牌 - 次级防护
      INVTYPE_CLOAK = 13635 -- 卷轴：附魔披风 - 防御
  },
  [851] = {
      INVTYPE_WRIST = 13642, -- 卷轴：附魔护腕 - 精神
      INVTYPE_SHIELD = 13659 -- 卷轴：附魔盾牌 - 精神
  },
  [943] = {
      INVTYPE_2HWEAPON = 13529, -- 卷轴：附魔双手武器 - 次级冲击
      INVTYPE_WEAPON = 13693 -- 卷轴：附魔武器 - 攻击
  },
  [852] = {
      INVTYPE_WRIST = 13648, -- 卷轴：附魔护腕 - 耐力
      INVTYPE_SHIELD = 13817 -- 卷轴：附魔盾牌 - 耐力
  },
  [849] = {
      INVTYPE_FEET = 13637, -- 卷轴：附魔靴子 - 次级敏捷
      INVTYPE_CLOAK = 13882 -- 卷轴：附魔披风 - 次级敏捷
  },
  [856] = {
      INVTYPE_WRIST = 13661, -- 卷轴：附魔护腕 - 力量
      INVTYPE_HAND = 13887 -- 卷轴：附魔手套 - 力量
  },
  [907] = {
      INVTYPE_WRIST = 13846, -- 卷轴：附魔护腕 - 强效精神
      INVTYPE_SHIELD = 13905 -- 卷轴：附魔盾牌 - 强效精神
  },
  [904] = {
      INVTYPE_HAND = 13815, -- 卷轴：附魔手套 - 敏捷
      INVTYPE_FEET = 13935 -- 卷轴：附魔靴子 - 敏捷
  },
  [927] = {
      INVTYPE_WRIST = 13939, -- 卷轴：附魔护腕 - 强效力量
      INVTYPE_HAND = 20013 -- 卷轴：附魔手套 - 强效力量
  },
  [929] = {
      INVTYPE_WRIST = 13945, -- 卷轴：附魔护腕 - 强效耐力
      INVTYPE_SHIELD = 20017 -- 卷轴：附魔盾牌 - 强效耐力
  },
  [1887] = {
    INVTYPE_HAND = 20012, -- 卷轴：附魔手套 - 强效敏捷
    INVTYPE_FEET = 20023, -- 卷轴：附魔靴子 - 强效敏捷
  },
  [1897] = { 
    INVTYPE_2HWEAPON = 13695, -- 卷轴：附魔双手武器 - 冲击
    INVTYPE_WEAPON = 20031 -- 卷轴：附魔武器 - 超强打击
  }, -- 此条新添加
  [2564] = {
      INVTYPE_WEAPON = 23800, -- 卷轴：附魔武器 - 敏捷
      INVTYPE_HAND = 25080 -- 卷轴：附魔手套 - 超强敏捷
  },
 --以下含有_era_后续版本内容
  [1891] = {
      INVTYPE_CHEST = 20025, -- 卷轴：附魔胸甲 - 强效属性
      INVTYPE_ROBE = 20025, -- 卷轴：附魔胸甲 - 强效属性
      INVTYPE_WRIST = 27905 -- 附魔护腕 - 属性
  },
  [1888] = {
      INVTYPE_CLOAK = 20014, -- 卷轴：附魔披风 - 强效抗性
      INVTYPE_SHIELD = 27947 -- 附魔盾牌 - 抗性
  },
  [2649] = {
    INVTYPE_CHEST = 27914, -- 附魔护腕 - 坚韧
    INVTYPE_ROBE = 27914, -- 附魔护腕 - 坚韧
    INVTYPE_FEET = 27950 -- 附魔长靴 - 坚韧
  },
  [963] = {
      INVTYPE_2HWEAPON = 13937, -- 卷轴：附魔双手武器 - 强效冲击
      INVTYPE_WEAPON = 27967 -- 附魔武器 - 特效打击
  },
  [3222] = {
      INVTYPE_WEAPON = 42620, -- 附魔武器 - 强效敏捷
      INVTYPE_HAND = 44529 -- 卷轴：附魔手套 - 特效敏捷
  },
  [983] = {
      INVTYPE_CLOAK = 44500, -- 卷轴：附魔披风 - 超强敏捷
      INVTYPE_FEET = 44589 -- 卷轴：附魔靴子 - 超强敏捷
  },
  [1147] = {
      INVTYPE_FEET = 44508, -- 卷轴：附魔靴子 - 强效精神
      INVTYPE_WRIST = 44593 -- 卷轴：附魔护腕 - 特效精神
  },
  [3231] = {
      INVTYPE_HAND = 44484, -- 卷轴：附魔手套 - 精准
      INVTYPE_WRIST = 44598 -- 卷轴：附魔护腕 - 精准
  },
  [2661] = {
      INVTYPE_CHEST = 27960, -- 附魔胸甲 - 优异属性
      INVTYPE_ROBE = 27960, -- 附魔胸甲 - 优异属性
      INVTYPE_WRIST = 44616 -- 卷轴：附魔护腕 - 强效属性
  },
  [1951] = {
      INVTYPE_CLOAK = 44591, -- 卷轴：附魔披风 - 泰坦之纹
      INVTYPE_CHEST = 46594, -- 卷轴：附魔胸甲 - 防御
      INVTYPE_ROBE = 46594 -- 卷轴：附魔胸甲 - 防御
  },
  [2648] = {
      INVTYPE_WRIST = 27906, -- 附魔护腕 - 特效防御
      INVTYPE_CLOAK = 47051 -- 卷轴：附魔披风 - 钢纹
  }

}


function lib:GetEnchantSpellID(ItemLink)
    local enchant = tonumber(string.match(ItemLink, "item:%d+:(%d+):"))

  local itemEquip = select(9, GetItemInfo(ItemLink))--获取 装备类型
     if (enchant and EnchantSpellDBEx[enchant]) then -- 有附魔 并且主目录不存在
        local enchantItemID = EnchantSpellDBEx[enchant][itemEquip] -- 副目录校验
        if (enchantItemID ~= nil) then 
            return EnchantSpellDBEx[enchant][itemEquip], enchant
        end
    end
    if (enchant and EnchantSpellDB[enchant]) then
        return EnchantSpellDB[enchant], enchant
    end
    return nil, enchant
end

function lib:GetEnchantItemID(ItemLink)
    local enchant = tonumber(string.match(ItemLink, "item:%d+:(%d+):"))
    if (enchant and EnchantItemDB[enchant]) then
        return EnchantItemDB[enchant], enchant
    end
    return nil, enchant
end
